Revit 2024 API
Metal.MetalPatternShader Property
 The property labeled "Image" from the "Metal" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string MetalPatternShader { get; }
Visual Basic
Public Shared ReadOnly Property MetalPatternShader As String
	Get
Visual C++
public:
static property String^ MetalPatternShader {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
See Also
Metal Class
Autodesk.Revit.DB.Visual Namespace